renesas/rx-driver-package/source/r_sci_iic_rx/r_sci_iic_rx_vx.xx/r_sci_iic_rx/src/targets/rx660/r_sci_iic_rx660.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
 * applicable laws, including copyright laws. 
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO 
 * THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the 
 * following link:
 * http://www.renesas.com/disclaimer 
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_sci_iic_rx660.c
 * Description  : Functions for using SCI_IIC on RX devices. 
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 31.12.2021 2.50     First Release
 **********************************************************************************************************************/
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
/* Access to peripherals and board defines. */
#include "platform.h"

#ifdef BSP_MCU_RX660
/* Defines for SCI_IIC support */
    #include "r_sci_iic_rx_pin_config.h"
    #include "r_sci_iic_rx_private.h"
    #include "r_sci_iic_rx660_private.h"
    #include "r_sci_iic_rx_if.h"
    #include "r_sci_iic_rx_config.h"

/***********************************************************************************************************************
 Private global variables and functions
 **********************************************************************************************************************/
static void sci_iic_set_frequency (sci_iic_info_t * p_sci_iic_info);
static void sci_iic_clear_ir_flag (sci_iic_info_t * p_sci_iic_info);

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 **********************************************************************************************************************/
/*----------------------------------------------------------------------------*/
/*   Defines specific information for each SCI IIC channel.                   */
/*----------------------------------------------------------------------------*/

    #if SCI_IIC_CFG_CH0_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch0_rom =
{
    BSP_LOCK_SCI0,
    (sci_regs_t)&SCI0,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRB.LONG, BIT31_MASK,
    &ICU.IPR[IPR_SCI0_TXI0].BYTE,
    &ICU.IR[IR_SCI0_TXI0].BYTE,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GRPBL0.LONG, BIT0_MASK,
    &ICU.IER[IER_SCI0_TXI0].BYTE, BIT3_MASK,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GENBL0.LONG, BIT0_MASK,
    BSP_INT_SRC_BL0_SCI0_TEI0,
    sci_iic_int_sci_iic0_tei_isr,
    SCI_IIC_CFG_CH0_INT_PRIORITY,
    SCI_IIC_CFG_CH0_SSCL_GP,
    SCI_IIC_CFG_CH0_SSCL_PIN,
    SCI_IIC_MPC_SSCL0_ENABLE,
    SCI_IIC_CFG_CH0_SSDA_GP,
    SCI_IIC_CFG_CH0_SSDA_PIN,
    SCI_IIC_MPC_SSDA0_ENABLE,
    SCI_IIC_CFG_CH0_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH0_BITRATE_BPS,
    SCI_IIC_CFG_CH0_DIGITAL_FILTER,
    SCI_IIC_CFG_CH0_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch0_ctrl =
{
    &g_sci_iic_ch0_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH1_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch1_rom =
{
    BSP_LOCK_SCI1,
    (sci_regs_t)&SCI1,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRB.LONG, BIT30_MASK,
    &ICU.IPR[IPR_SCI1_TXI1].BYTE,
    &ICU.IR[IR_SCI1_TXI1].BYTE,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GRPBL0.LONG, BIT2_MASK,
    &ICU.IER[IER_SCI1_TXI1].BYTE, BIT5_MASK,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GENBL0.LONG, BIT2_MASK,
    BSP_INT_SRC_BL0_SCI1_TEI1,
    sci_iic_int_sci_iic1_tei_isr,
    SCI_IIC_CFG_CH1_INT_PRIORITY,
    SCI_IIC_CFG_CH1_SSCL_GP,
    SCI_IIC_CFG_CH1_SSCL_PIN,
    SCI_IIC_MPC_SSCL1_ENABLE,
    SCI_IIC_CFG_CH1_SSDA_GP,
    SCI_IIC_CFG_CH1_SSDA_PIN,
    SCI_IIC_MPC_SSDA1_ENABLE,
    SCI_IIC_CFG_CH1_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH1_BITRATE_BPS,
    SCI_IIC_CFG_CH1_DIGITAL_FILTER,
    SCI_IIC_CFG_CH1_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch1_ctrl =
{
    &g_sci_iic_ch1_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO,
    (sci_iic_info_t *)NULL
};
    #endif

    #if SCI_IIC_CFG_CH2_INCLUDED
/* rom info */
const sci_iic_ch_rom_t g_sci_iic_ch2_rom =
{
    BSP_LOCK_SCI2,
    (sci_regs_t)&SCI2,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&SYSTEM.MSTPCRB.LONG, BIT29_MASK,
    &ICU.IPR[IPR_SCI2_TXI2].BYTE,
    &ICU.IR[IR_SCI2_TXI2].BYTE,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GRPBL0.LONG, BIT4_MASK,
    &ICU.IER[IER_SCI2_TXI2].BYTE, BIT7_MASK,
    (volatile uint32_t R_BSP_EVENACCESS_SFR *)&ICU.GENBL0.LONG, BIT4_MASK,
    BSP_INT_SRC_BL0_SCI2_TEI2,
    sci_iic_int_sci_iic2_tei_isr,
    SCI_IIC_CFG_CH2_INT_PRIORITY,
    SCI_IIC_CFG_CH2_SSCL_GP,
    SCI_IIC_CFG_CH2_SSCL_PIN,
    SCI_IIC_MPC_SSCL2_ENABLE,
    SCI_IIC_CFG_CH2_SSDA_GP,
    SCI_IIC_CFG_CH2_SSDA_PIN,
    SCI_IIC_MPC_SSDA2_ENABLE,
    SCI_IIC_CFG_CH2_SSDA_DELAY_SELECT,
    SCI_IIC_CFG_CH2_BITRATE_BPS,
    SCI_IIC_CFG_CH2_DIGITAL_FILTER,
    SCI_IIC_CFG_CH2_FILTER_CLOCK
};

/* channel control block */
sci_iic_ch_ctrl_t g_sci_iic_ch2_ctrl =
{
    &g_sci_iic_ch2_rom,
    SCI_IIC_EV_INIT,
    SCI_IIC_MODE_NONE,
    SCI_IIC_STS_NO_INIT,
    SCI_IIC_STS_NO_INIT,
    (uint8_t)INT_ZERO,
    (sci_iic_info_t *)NULL
};
    #endif

